#+title: Simple gradle with testng project
#+author: José Miguel
#+email: jm@0pt1mates.com
# -*- mode: org; -*-
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:http://thomasf.github.io/solarized-css/org-info.min.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />

* Abstract

Very simple project to be used as a template for gradle projects.

* Time report
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2014-10-13 Mon 23:05]
| Headline                                   | Time   |      |
|--------------------------------------------+--------+------|
| *Total time*                               | *0:52* |      |
|--------------------------------------------+--------+------|
| Time report                                | 0:52   |      |
| \emsp DONE Setup                           |        | 0:10 |
| \emsp DONE Simple implementation           |        | 0:21 |
| \emsp DONE Implementation using stream api |        | 0:21 |
#+END:

** DONE Setup
   CLOSED: [2014-10-13 Mon 20:46]
   CLOCK: [2014-10-13 Mon 20:36]--[2014-10-13 Mon 20:46] =>  0:10
** DONE Simple implementation
   CLOSED: [2014-10-13 Mon 21:08]
   CLOCK: [2014-10-13 Mon 20:47]--[2014-10-13 Mon 21:08] =>  0:21
** DONE Implementation using stream api
   CLOSED: [2014-10-13 Mon 22:28]
   CLOCK: [2014-10-13 Mon 22:07]--[2014-10-13 Mon 22:28] =>  0:21
